restapi/models/LoginForm.php

    public function login()
    {
        $user = $this->getUser();
        if ($this->validate()) {
            $token = Yii::$app->security->generateRandomString();
            $user->access_token = $token;
            return $user->save() ? $token : null;
---
UPDATE `user` SET `access_token`='bG826tODMyHz5gec6s361MRzUPfFNbBS', `updated_at`=1611692623 WHERE `id`=1